const product_20_image_01 =
  require("../images/products/product-20 (1).jpg").default;
const product_20_image_02 =
  require("../images/products/product-20 (2).jpg").default;

const product_30_image_01 =
  require("../images/products/product-30 (1).jpg").default;
const product_30_image_02 =
  require("../images/products/product-30 (2).jpg").default;

const product_40_image_01 =
  require("../images/products/product-40 (1).jpg").default;
const product_40_image_02 =
  require("../images/products/product-40 (2).jpg").default;
const product_50_image_01 =
  require("../images/products/product-50 (1).jpg").default;
const product_50_image_02 =
  require("../images/products/product-50 (2).jpg").default;
const product_60_image_01 =
  require("../images/products/product-60 (1).jpg").default;
const product_60_image_02 =
  require("../images/products/product-60 (2).jpg").default;
const product_70_image_01 =
  require("../images/products/product-70 (1).jpg").default;
const product_70_image_02 =
  require("../images/products/product-70 (2).jpg").default;
const product_80_image_01 =
  require("../images/products/product-80 (1).jpg").default;
const product_80_image_02 =
  require("../images/products/product-80 (2).jpg").default;

const product_90_image_01 =
  require("../images/products/product-90 (1).jpg").default;
const product_90_image_02 =
  require("../images/products/product-90 (2).jpg").default;
const product_100_image_01 =
  require("../images/products/product-100 (1).jpg").default;
const product_100_image_02 =
  require("../images/products/product-100 (2).jpg").default;
const ases = [
  {
    title: "Сумка",
    price: "300",
    image01: product_40_image_01,
    image02: product_40_image_02,
    categorySlug: "sy-1",
    colors: ["white", "red"],
    slug: "sy-1",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Таписка",
    price: "189000",
    image01: product_20_image_01,
    image02: product_20_image_02,
    categorySlug: "dr",
    colors: ["white", "red"],
    slug: "dr-12",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Сумка",
    price: "300",
    image01: product_80_image_01,
    image02: product_80_image_02,
    categorySlug: "sy",
    colors: ["white", "red"],
    slug: "sy-1",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Сумка",
    price: "300",
    image01: product_30_image_01,
    image02: product_30_image_02,
    categorySlug: "sy",
    colors: ["white", "red"],
    slug: "sy-1",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Сумка",
    price: "300",
    image01: product_50_image_01,
    image02: product_50_image_02,
    categorySlug: "sy",
    colors: ["white", "red"],
    slug: "sy-1",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Сумка",
    price: "300",
    image01: product_60_image_01,
    image02: product_60_image_02,
    categorySlug: "sy",
    colors: ["white", "red"],
    slug: "sy-1",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Сумка",
    price: "300",
    image01: product_70_image_01,
    image02: product_70_image_02,
    categorySlug: "sy",
    colors: ["white", "red"],
    slug: "sy-1",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Сумка",
    price: "300",
    image01: product_90_image_01,
    image02: product_90_image_02,
    categorySlug: "sy",
    colors: ["white", "red"],
    slug: "sy-1",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Сумка",
    price: "300",
    image01: product_100_image_01,
    image02: product_100_image_02,
    categorySlug: "sy",
    colors: ["white", "red"],
    slug: "sy-1",

    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },

  // 18 products
];

const getAllProducts = () => ases;

const getProducts = (count) => {
  const max = ases.length - count;
  const min = 0;
  const start = Math.floor(Math.random() * (max - min) + min);
  return ases.slice(start, start + count);
};

const getProductBySlug = (slug) => ases.find((e) => e.slug === slug);

const getCartItemsInfo = (cartItems) => {
  let res = [];
  if (cartItems.length > 0) {
    cartItems.forEach((e) => {
      let ases = getProductBySlug(e.slug);
      res.push({
        ...e,
        ases: ases,
      });
    });
  }
  // console.log(res)
  // console.log('sorted')
  // console.log(res.sort((a, b) => a.slug > b.slug ? 1 : (a.slug < b.slug ? -1 : 0)))
  return res.sort((a, b) => (a.id > b.id ? 1 : a.id < b.id ? -1 : 0));
};

const productData2 = {
  getAllProducts,
  getProducts,
  getProductBySlug,
  getCartItemsInfo,
};

export default productData2;
